"use strict";

function MR_convertWord(inputString, mode) {
  var WordList = [["7", "A公司負責人打電話來，他很急，請你快點打電話給他。", "總經理，A公司負責人致電，有要事找您，請您撥冗回電。"], ["3", "快去讀書，你都快考不上大學了", "快去讀書，才能考上好大學，加油！"], ["3", "你整天都在滑手機，再滑我就沒收", "媽不想限制你使用手機，但不希望看到你大部分時間都在滑手機，希望妳能分配時間，好嗎？"], ["3", "你可不可以不要一直唸啊，煩死了，我都成年了還一直管", "好，我知道妳是關心我，謝謝你，我收到了，我長大了我會管好自己，不讓你操心。"], ["1", "你又想怎樣", "寶貝，對不起 再給我一次機會我一定改進"], ["1", "你又想怎樣", "寶貝，對不起 那妳希望我能怎麼做🥺"], ["1", "你還想怎樣", "寶貝，對不起 再給我一次機會我一定改進"], ["1", "你還想怎樣", "寶貝，對不起 那妳希望我能怎麼做🥺"], ["1", "阿不然呢", "寶貝，對不起 再給我一次機會我一定改進"], ["1", "阿不然呢", "寶貝，對不起 那妳希望我能怎麼做🥺"], ["1", "不然你要怎麼樣嘛", "寶貝，對不起 再給我一次機會我一定改進"], ["1", "不然你要怎麼樣嘛", "寶貝，對不起 那妳希望我能怎麼做🥺"], ["1", "因為你本身不是說很瘦，這件顯腰粗，而且你腿有很細嗎？沒有的話就穿長褲不要選裙子。", "這件沒辦法將你的優勢展現！而且我覺得妳穿裙子比長褲好看。寶貝，我覺得妳穿裙子更好看。	"], ["1", "你又生氣了，又是我的錯，好拉我錯了，都是我的錯你贏了吧", "對不起讓你不高興了，我的錯，我一定會改進！不要生氣了好嗎！	"], ["1", "幹，這樣也要不爽？那你看那些帥哥我有說什麼嗎？那好，我全部刪掉，你滿意了吧?", "你不開心是不是?我馬上改，那好，我全部刪掉，不要不開心了。"], ["1", "我就公司真的有事無法抽身 ，你可以體諒我一下嗎？", "寶貝，對不起，公司臨時有事無法抽身，所以遲到了，我也好難過不能早點看到你。"], ["1", "你真的很過分欸，為什麼別人的男朋友都記得", "沒關係，有你陪在我身邊，我就很滿足了"], ["1", "你高興就好", "我覺得都不錯欸，你目前覺得哪個比較好"], ["1", "可以", "嗯我覺得不錯啊，跟你出去玩去哪都好"], ["1", "我在上班，你多喝熱水", "寶貝，我在上班，你先喝點熱水緩和休息一下，我下班就買紅豆湯給妳喝！"], ["1", "嗯我覺得在這件事，是妳自己情緒化她只是正常反應", "嗯！沒錯，但寶貝不要生氣了，我們不要為了不重要的人心情不好，假日帶你出去玩消消氣！"], ["1", "我哪有", "既然我們都一樣！那扯平！我們一起改進"], ["1", "那你說說看哪裡錯啊", "這次就原諒你，但是你現在要陪我看場電影。下次再這樣，你就親自下廚煮一桌給我吃。"], ["1", "我又沒幹嘛", "對不起我自以為這是小事，讓你不高興了，沒有下一次了，以後一定會先告訴你"], ["1", "是要等幾下啦", "那再給你5分鐘喔！"], ["1", "有必要這個態度嗎", "你這個大笨蛋，我沒有想要你怎樣，只是想陪陪你，覺得自己什麼忙都幫不上你而已。"], ["1", "對、我是真的不懂", "那我可以重新了解你嗎？"], ["1", "你什麼時候才要去掃地啦", "寶貝你去掃地，我幫忙拖地，我們一起把環境弄乾淨！"], ["1", "隨便你，你開心就好", "如果這樣會讓你舒服一點，那我願意做到！"], ["1", "我不想管你了，這樣也要生氣", "原來這樣會讓你不開心，下次不會了"], ["1", "你真的莫名其妙ㄟ", "你怎麼會這樣想呢"], ["1", "你去查阿，不然每次都我一個人在查", "你幫我查一下好不好"], ["1", "兇什麼啊", "寶貝不要這樣嗎，我現在就去查"], ["1", "就跟你說我沒空了，先自己搭車回來好嗎?	", "我現在真的沒有空~，你先自己搭車回來好不好~"], ["1", "也是可以啦。", "沒問題喔"], ["1", "很無聊", "沒有很有趣"], ["1", "瘦", "苗條"], ["1", "可不可以不要每次都這樣，你直接跟我說不就好了", "寶貝不要這樣嘛，我下次一定不會忘了，你可以跟我說嗎"], ["1", "為什麼別人可以做到，你就不行", "別人可以做到的，你也一定可以"], ["1", "要幹嘛", "要做什麼啊"], ["1", "隨便", "都可以啊"], ["1", "嗯嗯", "可以啊"], ["1", "對啦", "確定喔"], ["1", "還好吧", "還不錯啊"], ["1", "不清楚，我在忙", "不知道欸，我剛剛在忙	"], ["1", "憑什麼都是我讓步啊?", "我現在沒有辦法配合你，因為我也很生氣。	"], ["1", "我知道我錯了，但難道妳都沒錯嗎?	", "我會改進，但是我們兩個人應該都有責任。	"], ["1", "不應該是這樣吧", "這樣可能錯了喲	"], ["1", "你好好說話行嗎?", "我需要你用溫和一點的方式跟我說話。	"], ["1", "你又幹嘛了", "妳怎麼了阿	"]];
  var outputString = [inputString];
  var counter = 0;

  for (var index = 0; index < WordList.length; index++) {
    if (WordList[index][0] == mode) {
      if (WordList[index][1] == inputString) {
        if (counter == 0) {
          outputString[0] = WordList[index][2];
        } else {
          outputString.push(WordList[index][2]);
        }

        counter++;
      }
    }
  }

  console.log(inputString + " -CV-> " + outputString);
  return outputString;
}